In [28]:
import pandas as pd

In [29]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [45]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
X = df.drop('Survived', axis='columns')
y = df[['Survived']]

In [46]:
X.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [47]:
y.head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [71]:
from sklearn.preprocessing import LabelEncoder

le_Sex = LabelEncoder()
X.Sex = le_Sex.fit_transform(X.Sex)

In [88]:
X.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500

In [75]:
X.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [73]:
count = 0
for i in range(len(X)):
    if X.Age.isnull()[i] == True:
        count = count + 1

print(count)

177

In [77]:
import numpy as np

m = X.Age.mean(skipna = True)
X.Age = X.Age.replace(np.NaN, m)

In [79]:
count = 0
for i in range(len(X)):
    if X.Age.isnull()[i] == True:
        count = count + 1

print(count)

0

In [80]:
from sklearn.model_selection import train_test_split

In [81]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=3)

In [82]:
from sklearn.tree import DecisionTreeClassifier

In [83]:
survival_tree = DecisionTreeClassifier(criterion='entropy', max_depth=4)

In [84]:
survival_tree.fit(X_train, y_train)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='entropy',
                       max_depth=4, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [85]:
y_hat = survival_tree.predict(X_test)

In [87]:
from sklearn import metrics

accuracy = metrics.accuracy_score(y_test, y_hat)
print(accuracy)

0.770949720670391

In [90]:
survival_tree.predict([[3, 1, 22, 7.5]])

array([0], dtype=int64)